
## Plan Result (terraform/aws/palserver)

[CI link](https://github.com/boxp/arch/actions/runs/8253584145)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ecr_repository.palserver
  * aws_kms_key.ecr_kms


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecr_repository.palserver will be created
  + resource "aws_ecr_repository" "palserver" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "palserver"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_kms_key.ecr_kms will be created
  + resource "aws_kms_key" "ecr_kms" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = (known after apply)
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":49,"Program":"tfcmt","SHA1":"d780594ef1eecfd2b8b3f9604954afdc4a32e547","Target":"terraform/aws/palserver","Vars":{},"WorkflowName":"pull_request_target"} -->